#include "Kalman.h"

/**----------------------------------------------------------------------
* Function    : EKF_Init
* Description : 初始化卡尔曼滤波器相关
* Date        : 2022/09/21 logzhan
*---------------------------------------------------------------------**/
void EKF_Init(void) {

}


/**----------------------------------------------------------------------
* Function    : EKFCalQRMatrix
* Description : 根据GPS信号特征调整卡尔曼滤波噪声矩阵，q矩阵是过程噪声矩阵，
*               需要跟惯导预测位置精度相关。r矩阵为GNSS观测噪声，跟GPS输出的
*               信息精度有关。
* Date        : 2022/09/21 logzhan
*---------------------------------------------------------------------**/
void EKFCalQRMatrix() {

}


/**----------------------------------------------------------------------
* Function    : EKFStateUpdate
* Description : 扩展卡尔曼滤波器的状态更新方程
* Date        : 2020/7/22 logzhan
*---------------------------------------------------------------------**/
void EKFStateUpdate() {

}