#ifndef _PDR_KALMAN_H_
#define _PDR_KALMAN_H_

#include "PDRBase.h"

/**----------------------------------------------------------------------
* Function    : EKF_Init
* Description : 初始化卡尔曼滤波器相关
* Date        : 2022/09/21 logzhan
*---------------------------------------------------------------------**/
void EKF_Init(void);

/**----------------------------------------------------------------------
* Function    : EKFCalQRMatrix
* Description : 根据GPS信号特征调整卡尔曼滤波噪声矩阵，q矩阵是过程噪声矩阵，
*               需要跟惯导预测位置精度相关。r矩阵为GNSS观测噪声，跟GPS输出的
*               信息精度有关。
* Date        : 2022/09/21 logzhan
*---------------------------------------------------------------------**/
void EKFCalQRMatrix();


/**----------------------------------------------------------------------
* Function    : EKFUpdateInsState
* Description : 扩展卡尔曼滤波器更新INS状态
* Date        : 2022/09/23 logzhan
*---------------------------------------------------------------------**/
void EKFUpdateInsState(void);

#endif